aaron-bond.better-comments
anthropic.claude-code
blackboxapp.blackbox
charliermarsh.ruff
codezombiech.gitignore
docker.docker
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
entuent.fira-code-nerd-font
esbenp.prettier-vscode
george-alisson.html-preview-vscode
github.codespaces
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
janisdd.vscode-edit-csv
jianbingfang.dupchecker
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
tomoki1207.pdf
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
yzane.markdown-pdf
